In [1]:
import pandas as pd

In [2]:
print (pd.__version__)

1.3.4

In [3]:
# Pandas series
# series represents one column

series_01=pd.Series(data=[1,7,19,4,17],index=["a","b","c","d","e"])
series_01

a     1
b     7
c    19
d     4
e    17
dtype: int64

In [4]:
type(series_01)

pandas.core.series.Series

In [5]:
series_02=pd.Series(data=[9,8,7,6,5],index=list('abcde'))
series_02

a    9
b    8
c    7
d    6
e    5
dtype: int64

In [8]:
series_03=pd.Series(data=[12,13,7,16,5],index=list('abcde'))
series_03

a    12
b    13
c     7
d    16
e     5
dtype: int64

In [9]:
series_04=pd.Series(data=[2,8,2,6,15],index=list('abcde'))
series_04

a     2
b     8
c     2
d     6
e    15
dtype: int64

In [10]:
series_05=pd.Series(data=[19,11,7,6,15],index=list('abcde'))
series_05

a    19
b    11
c     7
d     6
e    15
dtype: int64

In [12]:
# dataframe is 2d tabular structured data
df = pd.DataFrame({"Maths":series_01,"Science":series_02,"History":series_03,"English":series_04,"SST":series_05})
df

   Maths  Science  History  English  SST
a      1        9       12        2   19
b      7        8       13        8   11
c     19        7        7        2    7
d      4        6       16        6    6
e     17        5        5       15   15

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
import numpy as np

dataframe_01 = pd.DataFrame(data = np.random.randint(1,10, size = (10,10)), columns = list('abcdefghij'))
dataframe_01

   a  b  c  d  e  f  g  h  i  j
0  9  7  8  9  1  6  2  4  9  1
1  1  5  5  8  4  6  8  9  5  1
2  5  9  1  3  2  6  1  3  2  1
3  7  5  9  8  4  9  2  7  8  7
4  2  6  8  5  3  6  7  1  3  3
5  6  2  3  4  5  6  8  3  3  4
6  8  4  9  4  9  4  2  2  1  8
7  6  7  9  3  3  3  7  9  3  8
8  6  7  8  8  2  2  5  3  1  2
9  3  9  2  5  5  8  2  2  9  9

In [ ]:
# loading csv (Comma seperated values) file

data = pd.read_csv('path') # use forward slash for path in python

In [ ]:
data.head() # shows top 5 rows

In [ ]:
data.head(10) # shows top 10 rows

In [ ]:
pd.set_option('display.max_rows',None)

In [ ]:
data.tail() # shows last 5 rows

In [ ]:
data.info() # shows info about dataframe

In [ ]:
data_iter = pd.read_csv('path',chunksize = 5000) # divides data into numbers of chunks

In [ ]:
# json (javascript object Notation) 
# json has replaced xml
# json is like dictionary. Mostly used for unstructured data

In [ ]:
movies_data = pd.read_json('path')
movies_data

In [ ]:
# NaN -  not a number  -  mosly represents missing value

In [ ]:
# Connecting databases

In [16]:
! pip install pysqlite3

Collecting pysqlite3
  Downloading pysqlite3-0.4.7.tar.gz (40 kB)
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (setup.py): started
  Building wheel for pysqlite3 (setup.py): finished with status 'done'
  Running setup.py clean for pysqlite3
Failed to build pysqlite3
Installing collected packages: pysqlite3
    Running setup.py install for pysqlite3: started
    Running setup.py install for pysqlite3: finished with status 'done'
Successfully installed pysqlite3

  WARNING: Legacy build of wheel for 'pysqlite3' created no files.
  Command arguments: 'C:\Users\DEVVRAK\anaconda3\python.exe' -u -c 'import io, os, sys, setuptools, tokenize; sys.argv[0] = '"'"'C:\\Users\\DEVVRAK\\AppData\\Local\\Temp\\pip-install-j75rybhe\\pysqlite3_d1e29f8f5aac4606bdf8f55bc1f22d2d\\setup.py'"'"'; __file__='"'"'C:\\Users\\DEVVRAK\\AppData\\Local\\Temp\\pip-install-j75rybhe\\pysqlite3_d1e29f8f5aac4606bdf8f55bc1f22d2d\\setup.py'"'"';f = getattr(tokenize, '"'"'open'"'"', open)(__file__) if os.path.exists(__file__) else io.StringIO('"'"'from setuptools import setup; setup()'"'"');code = f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' bdist_wheel -d 'C:\Users\DEVVRAK\AppData\Local\Temp\pip-wheel-1qyatl8m'
  Command output: [use --verbose to show]

In [17]:
import sqlite3

In [ ]:
connection_obj = sqlite3.connect('databases.sqlite')

In [ ]:
pd.read_sql_query("SELECT + FROM Reviews LIMIT 5", connection_obj)

In [ ]:
# import MySQLdb
# mysql_conn = MySQLdb.connect(host='myhost',port=3306,user = "username", passwd = "xyz", db = 'information_students')

In [32]:
#handling duplicate data

df = pd.DataFrame({"a":[5,8,"chicken",7,"chicken",8], "b":[6,7,"chicken",9,"chicken",7], "c":[9,5,"chicken",4,"chicken",5]})
df

         a        b        c
0        5        6        9
1        8        7        5
2  chicken  chicken  chicken
3        7        9        4
4  chicken  chicken  chicken
5        8        7        5

In [33]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [34]:
df[df.duplicated()]

         a        b        c
4  chicken  chicken  chicken
5        8        7        5

In [35]:
df[~ df.duplicated()]

         a        b        c
0        5        6        9
1        8        7        5
2  chicken  chicken  chicken
3        7        9        4

In [36]:
df

         a        b        c
0        5        6        9
1        8        7        5
2  chicken  chicken  chicken
3        7        9        4
4  chicken  chicken  chicken
5        8        7        5

In [37]:
df = df[~ df.duplicated()]
df

         a        b        c
0        5        6        9
1        8        7        5
2  chicken  chicken  chicken
3        7        9        4

In [ ]:
# function application

'''
1. map() for transforming one column into another - can only be applied to series
'''

In [ ]:
def fah_to_cel(f):
    C = (f-32) * (5/9)
    return C

In [ ]:
df = pd.DataFrame({"a":[5,8,"chicken",7,"chicken",8], "farenheit":[30,25,"chicken",9,"chicken",7]})

In [ ]:
b=sorted(list(set(score_list)))[1] 

print(Result)
for a,c in sorted(Result):
    if c==b:
        print(a)